RhinoInside.Revit API Documentation
RectangleConverter Class
 Converter to convert Rectangle values to and from Autodesk.Revit.DB.Rectangle.
Inheritance Hierarchy
System.Object
 RhinoInside.Revit.Convert.System.Drawing.RectangleConverter
 Namespace: RhinoInside.Revit.Convert.System.Drawing
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static class RectangleConverter
class RectangleConverter
Methods
Name | Description
ToRectangle(Rectangle)
 Converts the specified Autodesk.Revit.DB.Rectangle to an equivalent Rectangle.
ToRectangle(Rectangle)
 Converts the specified Rectangle to an equivalent Autodesk.Revit.DB.Rectangle.
Top
See Also
Reference
RhinoInside.Revit.Convert.System.Drawing Namespace